#### load SQL extension

In [2]:
%reload_ext sql

#### connect to world db

In [4]:
import os
from dotenv import load_dotenv
load_dotenv()

DB_NAME = os.getenv("DB_NAME")

DB_USER = os.getenv("DB_USER")
DB_PASSWORD = os.getenv("DB_PASSWORD")
DB_HOST = os.getenv("DB_HOST")
DB_PORT = os.getenv("DB_PORT")

connection_string = f"mysql+pymysql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"

%sql $connection_string

'Connected: root@world'

### show tables in world database

In [15]:
%sql SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/world
3 rows affected.

[('city',), ('country',), ('countrylanguage',)]

####List all cities in Kenya

In [16]:
%%sql
SELECT
    Name,
    District,
    Population
FROM
    city
WHERE
    CountryCode = "KEN";

 * mysql+pymysql://root:***@localhost:3306/world
8 rows affected.

[('Nairobi', 'Nairobi', 2290000),
 ('Mombasa', 'Coast', 461753),
 ('Kisumu', 'Nyanza', 192733),
 ('Nakuru', 'Rift Valley', 163927),
 ('Machakos', 'Eastern', 116293),
 ('Eldoret', 'Rift Valley', 111882),
 ('Meru', 'Eastern', 94947),
 ('Nyeri', 'Central', 91258)]

#### Number of countries per continent

In [5]:
%%sql
SELECT 
	Continent,
    COUNT(*) AS NumberOfCountries
FROM
	country
GROUP BY 
	Continent
ORDER BY
	NumberOfCountries;

 * mysql+pymysql://root:***@localhost:3306/world
7 rows affected.

[('Antarctica', 5),
 ('South America', 14),
 ('Oceania', 28),
 ('North America', 37),
 ('Europe', 46),
 ('Asia', 51),
 ('Africa', 58)]

#### Top 10 populated cities in the world

In [6]:
%%sql
SELECT
    Name,
    CountryCode,
    Population
FROM
    city
ORDER BY 
    Population DESC
LIMIT
    10;

 * mysql+pymysql://root:***@localhost:3306/world
10 rows affected.

[('Mumbai (Bombay)', 'IND', 10500000),
 ('Seoul', 'KOR', 9981619),
 ('São Paulo', 'BRA', 9968485),
 ('Shanghai', 'CHN', 9696300),
 ('Jakarta', 'IDN', 9604900),
 ('Karachi', 'PAK', 9269265),
 ('Istanbul', 'TUR', 8787958),
 ('Ciudad de México', 'MEX', 8591309),
 ('Moscow', 'RUS', 8389200),
 ('New York', 'USA', 8008278)]